In [1]:
# Square a list using Python
squared_values = []
for number in range(10):
    squared_values.append(number*number)
    
print(squared_values)

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [2]:
# Square a list using NumPy
import numpy as np
vector = np.array(range(10))
print(vector)

[0 1 2 3 4 5 6 7 8 9]

In [3]:
scalar = 5
vector * scalar

array([ 0,  5, 10, 15, 20, 25, 30, 35, 40, 45])

In [4]:
vector * vector

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81])

In [ ]:
my_list = [1, 2, 3]
print(my_list)

import numpy as np

my_vector = np.array(my_list)
print(my_vector)

my_matrix = np.array([my_list, my_list])
np.hstack([my_list, my_list])

my_nested_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
my_matrix = np.array(my_nested_list)
print(my_matrix)

my_list1 = [[1,2], [3,4]]
my_list2 = [[5,6], [7,8]]  
np.hstack([my_list1, my_list2])   
np.vstack([my_list1, my_list2])

In [5]:
my_list = [1, 2, 3]
print(my_list)

[1, 2, 3]

In [6]:
import numpy as np
my_vector = np.array(my_list)
print(my_vector)

[1 2 3]

In [7]:
my_matrix = np.array([my_list, my_list])

In [8]:
my_matrix

array([[1, 2, 3],
       [1, 2, 3]])

In [9]:
np.hstack([my_list, my_list])

array([1, 2, 3, 1, 2, 3])

In [13]:
np.array(my_list*10).reshape(10,3)

array([[1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3],
       [1, 2, 3]])

In [14]:
my_nested_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
my_matrix = np.array(my_nested_list)

In [15]:
my_matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [16]:
my_list1 = [[1,2], [3,4]]
my_list2 = [[5,6], [7,8]]  
np.hstack([my_list1, my_list2])

array([[1, 2, 5, 6],
       [3, 4, 7, 8]])

In [17]:
np.vstack([my_list1, my_list2])

array([[1, 2],
       [3, 4],
       [5, 6],
       [7, 8]])

In [18]:
np.array([my_list1, my_list2])

array([[[1, 2],
        [3, 4]],

       [[5, 6],
        [7, 8]]])

In [ ]:
my_list = range(10)

## Create array using arange
np.arange(10)
np.arange(0, 10)
np.arange(0, 10, 2)

In [20]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [21]:
np.arange(0, 10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [22]:
np.arange(0, 10, 2)2

array([0, 2, 4, 6, 8])

In [25]:
## Create array of zeros
np.zeros(3)

array([0., 0., 0.])

In [24]:
np.zeros((3,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [27]:
np.zeros((1,3))

array([[0., 0., 0.]])

In [28]:
np.zeros((3,1))

array([[0.],
       [0.],
       [0.]])

In [30]:
# (ROW, COLUMN)

np.ones(3) # np.ones((1,3))

array([1., 1., 1.])

In [31]:
np.ones((1,3))

array([[1., 1., 1.]])

In [32]:
np.ones((3,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [33]:
np.ones(3)*4

array([4., 4., 4.])

In [34]:
np.linspace(0, 10, 5)

array([ 0. ,  2.5,  5. ,  7.5, 10. ])

In [35]:
np.linspace(1900, 2000, 11)

array([1900., 1910., 1920., 1930., 1940., 1950., 1960., 1970., 1980.,
       1990., 2000.])

In [36]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [37]:
np.empty((2,3))

array([[0., 0., 0.],
       [0., 0., 0.]])

In [38]:
np.random.randint(1,101)

88

In [39]:
np.random.rand(3,3)

array([[0.28244403, 0.42911739, 0.94795042],
       [0.9810053 , 0.4943581 , 0.44769924],
       [0.1014589 , 0.40188828, 0.74811859]])

In [40]:
np.random.randn(3)

array([-1.86507857,  0.10284415, -1.05832776])

In [41]:
np.random.randint(1,101,5)

array([89,  7, 89, 19, 99])

In [42]:
np.random.randint(1,7,10)

array([4, 1, 6, 1, 5, 2, 6, 2, 5, 4])

In [43]:
vector = np.arange(1,10)

In [44]:
vector

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [45]:
vector.reshape((3,3))

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [46]:
vector = np.arange(1,13)

In [48]:
print(vector.reshape(3,4))

[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]

In [49]:
print(vector.reshape(4,3))

[[ 1  2  3]
 [ 4  5  6]
 [ 7  8  9]
 [10 11 12]]

In [50]:
vector = np.random.randint(1,50,25)

In [51]:
vector

array([27, 30, 36, 45, 16, 37, 27,  9, 16, 29, 10, 45, 29, 36, 21, 23, 21,
       11,  6, 30, 21, 16, 14, 23, 10])

In [52]:
vector.min()

6

In [53]:
vector.max()

45

In [54]:
index = vector.argmin()

In [55]:
index

18

In [56]:
index = vector.argmax()
index

3

In [57]:
vector.shape

(25,)

In [58]:
my_matrix = vector.reshape(5, 5)

In [59]:
my_matrix.shape

(5, 5)

In [ ]:
vector = np.array(range(10))
# vector[index]
# vector [start:end]
# vector [:end]
# vector [start:]
# vector [start, end, step]

vector[3]
vector[3:8]
vector[:5]
vector[5:]
vector[3:9:2]
vector[-1]

In [60]:
vector = np.array(range(10))

In [63]:
vector[:5]

array([0, 1, 2, 3, 4])

In [64]:
range(10)
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [65]:
np.array(range(10))

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [66]:
vector[3:6] = 12

In [67]:
vector

array([ 0,  1,  2, 12, 12, 12,  6,  7,  8,  9])

In [68]:
vector = np.arange(20)

In [69]:
vector

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19])

In [70]:
vector[6:9] = 100
vector

array([  0,   1,   2,   3,   4,   5, 100, 100, 100,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19])

In [71]:
vector = np.array(range(10))

In [72]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [73]:
my_slice = vector[3:7]
my_slice

array([3, 4, 5, 6])

In [74]:
my_slice[:] = 20
my_slice

array([20, 20, 20, 20])

In [75]:
vector

array([ 0,  1,  2, 20, 20, 20, 20,  7,  8,  9])

In [76]:
vector = np.array(range(10))
my_slice_copy = vector[3:7].copy()
print(vector)

[0 1 2 3 4 5 6 7 8 9]

In [77]:
my_slice_copy[:] = 100

In [78]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [2]:
# np.arange(start, end(not included), step size)
import numpy as np
np.arange(2,11,2)

array([ 2,  4,  6,  8, 10])

In [3]:
matrix = np.array(range(1,10)).reshape((3,3))

In [4]:
matrix[0,0]

1

In [5]:
matrix[0][0]

1

In [ ]:
matrix[0,0]
matrix[0][0] 
matrix[2,2]  
matrix[2][2] 


matrix[:,2] # Grab the third column
matrix[1,:] # Grab the second row
matrix[:2] # grab the first two rows, all columns
matrix[:2,:] # grab the first two rows, all columns
matrix[:,1:] # grab all the rows, but columns starting from 1

In [6]:
matrix[:,2]

array([3, 6, 9])

In [7]:
matrix[1,:]

array([4, 5, 6])

In [8]:
matrix[:2]

array([[1, 2, 3],
       [4, 5, 6]])

In [9]:
matrix[:2,:]

array([[1, 2, 3],
       [4, 5, 6]])

In [10]:
matrix[:,1:]

array([[2, 3],
       [5, 6],
       [8, 9]])

In [11]:
vector = np.arange(10)

In [12]:
gt2 = vector > 2

In [13]:
gt2

array([False, False, False,  True,  True,  True,  True,  True,  True,
        True])

In [14]:
lt8 = vector < 8

In [15]:
selected_gt2 = vector[gt2]

In [17]:
selected_gt2

array([3, 4, 5, 6, 7, 8, 9])

In [18]:
selected_lt8 = vector[lt8]
selected_lt8

array([0, 1, 2, 3, 4, 5, 6, 7])

In [19]:
vector[vector%2==0]

array([0, 2, 4, 6, 8])

In [24]:
cond = (vector>2) & (vector<7)

In [25]:
vector[cond]

array([3, 4, 5, 6])

In [26]:
cond = (vector>=2) & (vector<=7)
vector[cond]

array([2, 3, 4, 5, 6, 7])

In [27]:
vector = np.arange(10)
vector + vector

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [28]:
vector / vector

C:\Users\mkhaw\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: invalid value encountered in true_divide
  """Entry point for launching an IPython kernel.

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [29]:
vector + 10

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [30]:
sum(vector<5)

5

In [31]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [32]:
vector<5

array([ True,  True,  True,  True,  True, False, False, False, False,
       False])

In [33]:
import math
vector = np.arange(1,11) * math.pi 
np.sin(vector)

array([ 1.22464680e-16, -2.44929360e-16,  3.67394040e-16, -4.89858720e-16,
        6.12323400e-16, -7.34788079e-16,  8.57252759e-16, -9.79717439e-16,
        1.10218212e-15, -1.22464680e-15])

In [34]:
vector = np.arange(0,math.pi+math.pi/4,math.pi/4)
np.sin(vector)

array([0.00000000e+00, 7.07106781e-01, 1.00000000e+00, 7.07106781e-01,
       1.22464680e-16])

In [35]:
matrix = np.random.rand(5,5)

In [36]:
matrix

array([[0.93304195, 0.30629867, 0.01672053, 0.31934438, 0.31645966],
       [0.69926702, 0.27641181, 0.94105717, 0.32013354, 0.8604046 ],
       [0.65587801, 0.38195566, 0.88757906, 0.60045335, 0.43136479],
       [0.47342644, 0.96738313, 0.95189002, 0.18629276, 0.62241073],
       [0.30052513, 0.77700837, 0.29100173, 0.55250266, 0.01043642]])

In [37]:
np.floor(matrix*1000)/1000

array([[0.933, 0.306, 0.016, 0.319, 0.316],
       [0.699, 0.276, 0.941, 0.32 , 0.86 ],
       [0.655, 0.381, 0.887, 0.6  , 0.431],
       [0.473, 0.967, 0.951, 0.186, 0.622],
       [0.3  , 0.777, 0.291, 0.552, 0.01 ]])

In [56]:
matrix = np.arange(1,10).reshape(3,3)
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [40]:
matrix.sum(axis=1)

array([ 6, 15, 24])

In [41]:
matrix.sum(axis=0)

array([12, 15, 18])

In [42]:
matrix.cumsum()

array([ 1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

In [43]:
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [44]:
matrix.cumprod()

array([     1,      2,      6,     24,    120,    720,   5040,  40320,
       362880], dtype=int32)

In [45]:
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [46]:

matrix.min(axis=1)

array([1, 4, 7])

In [59]:
matrix.min()

1

In [50]:
matrix = np.array([1,2,3]*3).reshape(3,3)

In [51]:
matrix

array([[1, 2, 3],
       [1, 2, 3],
       [1, 2, 3]])

In [52]:
np.unique(matrix.reshape(3,3))

array([1, 2, 3])

In [60]:
import numpy as np
import pandas as pd

header = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]

In [61]:
header

['chrom', 'pos', 'filter']

In [63]:
data

[4, 12345, 38.4]

In [64]:
vector = np.array(data)

In [65]:
vector

array([4.0000e+00, 1.2345e+04, 3.8400e+01])

In [66]:
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}

In [67]:
s1 = pd.Series(data=data)

In [68]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

In [69]:
s2 = pd.Series(data=data, index=header)

In [71]:
s2

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [72]:
data = [1, '2s', 34] 
pd.Series(data)

0     1
1    2s
2    34
dtype: object

In [73]:
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}
pd.Series(data_dict)

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [74]:
## Using index labels to fetch element
header = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]
series = pd.Series(data=data, index=header)

In [75]:
series

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [76]:
series['chrom']

4.0

In [77]:
series['filter']

38.4

In [78]:
series[0]

4.0

In [79]:
## Basic operations
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)

In [80]:
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [81]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom',  'filter', 'pos', 'qual']
data2 = [3, 234, 4899, 89.9]


s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)

In [82]:
s1+s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [83]:
12345 +  4899

17244

In [84]:
data1 = [4, 12345, 38.4]
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1)
s2 = pd.Series(data2)

s1+s2

0        7.0
1    17244.0
2      272.4
3        NaN
dtype: float64

In [85]:
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = ['3', 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
s1+s2

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [86]:
import numpy as np
import pandas as pd

header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

df = pd.DataFrame(data=data, columns=header)

In [87]:
display(df)

   exam1  exam2  exam3
0     65     83     91
1     68     70     70
2     85     88     96
3     71     78     78

In [88]:
df = pd.DataFrame(data=data, index=students, columns=header)

In [89]:
display(df)

          exam1  exam2  exam3
student1     65     83     91
student2     68     70     70
student3     85     88     96
student4     71     78     78

In [92]:
df['exam1']

student1    65
student2    68
student3    85
student4    71
Name: exam1, dtype: int32

In [97]:
df.exam1

student1    65
student2    68
student3    85
student4    71
Name: exam1, dtype: int32

In [94]:
exam1_column = 'exam1'
df[exam1_column]

student1    65
student2    68
student3    85
student4    71
Name: exam1, dtype: int32

In [98]:
df['average'] = (df['exam1'] + df['exam2'] + df['exam3'])/3

In [99]:
df

          exam1  exam2  exam3    average
student1     65     83     91  79.666667
student2     68     70     70  69.333333
student3     85     88     96  89.666667
student4     71     78     78  75.666667

In [100]:
df.drop('average')

KeyError: "['average'] not found in axis"

In [101]:
df.drop('average', axis=1)

          exam1  exam2  exam3
student1     65     83     91
student2     68     70     70
student3     85     88     96
student4     71     78     78

In [103]:
df.drop('student1')

          exam1  exam2  exam3    average
student2     68     70     70  69.333333
student3     85     88     96  89.666667
student4     71     78     78  75.666667

In [104]:
df

          exam1  exam2  exam3    average
student1     65     83     91  79.666667
student2     68     70     70  69.333333
student3     85     88     96  89.666667
student4     71     78     78  75.666667

In [105]:
df = df.drop('average', axis=1)

In [106]:
df

          exam1  exam2  exam3
student1     65     83     91
student2     68     70     70
student3     85     88     96
student4     71     78     78

In [107]:
df.drop('student1')

          exam1  exam2  exam3
student2     68     70     70
student3     85     88     96
student4     71     78     78

In [108]:
df

          exam1  exam2  exam3
student1     65     83     91
student2     68     70     70
student3     85     88     96
student4     71     78     78

In [109]:
df = df.drop('student1')

In [110]:
df

          exam1  exam2  exam3
student2     68     70     70
student3     85     88     96
student4     71     78     78

In [111]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student3']
df = pd.DataFrame(data=data, index=students, columns=header)

In [112]:
df

          exam1  exam2  exam3
student1     81     68     83
student2     85     68     83
student3     96     98     89
student3     66     99     78

In [113]:
df.drop('student3')

          exam1  exam2  exam3
student1     81     68     83
student2     85     68     83

In [114]:
df.drop('student3', inplace=True)

In [115]:
df

          exam1  exam2  exam3
student1     81     68     83
student2     85     68     83

In [116]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [117]:
df.loc['student1']
# df.iloc[0] ## remember that column names do not count as rows

exam1    86
exam2    71
exam3    66
Name: student1, dtype: int32

In [120]:
df.loc['student1']

exam1    86
exam2    71
exam3    66
Name: student1, dtype: int32

In [121]:
df.iloc[0]

exam1    86
exam2    71
exam3    66
Name: student1, dtype: int32

In [122]:
df

          exam1  exam2  exam3
student1     86     71     66
student2    100    100     78
student3    100     82     81
student4     81     99     67

In [123]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

df.loc['student1', 'exam1']

79

In [124]:
df

          exam1  exam2  exam3
student1     79     96     89
student2     75     93     83
student3     77     71     98
student4     67     68     97

In [125]:
df.loc[['student1', 'student3'], ['exam1', 'exam3']]

          exam1  exam3
student1     79     89
student3     77     98

In [135]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)
df

          exam1  exam2  exam3
student1     86     96     76
student2     74     92     75
student3     83     69     86
student4     89     98     98

In [127]:
df>=90

          exam1  exam2  exam3
student1  False  False  False
student2   True  False  False
student3  False  False   True
student4  False  False  False

In [128]:
df[df>=90]

          exam1  exam2  exam3
student1    NaN    NaN    NaN
student2   92.0    NaN    NaN
student3    NaN    NaN  100.0
student4    NaN    NaN    NaN

In [129]:
df['exam1']>=85 #

student1     True
student2     True
student3    False
student4    False
Name: exam1, dtype: bool

In [130]:
df[df['exam1']>=85]

          exam1  exam2  exam3
student1     89     81     81
student2     92     79     68

In [131]:
df

          exam1  exam2  exam3
student1     89     81     81
student2     92     79     68
student3     69     78    100
student4     78     89     66

In [132]:
df[df['exam1']>=85]['exam3']

student1    81
student2    68
Name: exam3, dtype: int32

In [133]:
df[df['exam1']>=85][['exam2', 'exam3']]

          exam2  exam3
student1     81     81
student2     79     68

In [136]:
df[(df['exam1']>=85) & (df['exam2']>=85)]

          exam1  exam2  exam3
student1     86     96     76
student4     89     98     98

In [137]:
df

          exam1  exam2  exam3
student1     86     96     76
student2     74     92     75
student3     83     69     86
student4     89     98     98

In [138]:
df[(df['exam1']>=85) & (df['exam2']>=85)]['exam3']

student1    76
student4    98
Name: exam3, dtype: int32

In [139]:
df[(df['exam1']>=85) | (df['exam2']>=85)]

          exam1  exam2  exam3
student1     86     96     76
student2     74     92     75
student4     89     98     98

In [174]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)

In [167]:
df

   exam1  exam2  exam3
0     65     81     97
1     72     80     85
2     85     87     95
3     72     90     81

In [176]:
df['name'] = students

In [169]:
df

   exam1  exam2  exam3      name
0     65     81     97  student1
1     72     80     85  student2
2     85     87     95  student3
3     72     90     81  student4

In [177]:
df.set_index('name', inplace=True)

In [171]:
df

          exam1  exam2  exam3
name
student1     65     81     97
student2     72     80     85
student3     85     87     95
student4     72     90     81

In [164]:
df.loc['student1']

exam1    92
exam2    88
exam3    70
Name: student1, dtype: int32

In [178]:
df.reset_index(inplace=True)

In [156]:
df.reset_index(drop=True)

   level_0  index      name  exam1  exam2  exam3
0        0      0  student1     72     69     78
1        1      1  student2     74     66     97
2        2      2  student3     77     74     92
3        3      3  student4     92     85     82

In [179]:
df

       name  exam1  exam2  exam3
0  student1     81     77     98
1  student2     91     93     90
2  student3     82     79     95
3  student4     65     86     71

In [180]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'

In [181]:
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())

In [182]:
df

                class1  class2
student1 exam1      70      81
         exam2      85      81
         exam3      81      79
student2 exam1      67      79
         exam2      72      92
         exam3      88      73
student3 exam1      72      86
         exam2      89      71
         exam3      76      77

In [183]:
'exam1 exam2 exam3'.split()*3

['exam1',
 'exam2',
 'exam3',
 'exam1',
 'exam2',
 'exam3',
 'exam1',
 'exam2',
 'exam3']

In [184]:
list(zip(students.split(), exams))

[('student1', 'exam1'),
 ('student1', 'exam2'),
 ('student1', 'exam3'),
 ('student2', 'exam1'),
 ('student2', 'exam2'),
 ('student2', 'exam3'),
 ('student3', 'exam1'),
 ('student3', 'exam2'),
 ('student3', 'exam3')]

In [185]:
index = pd.MultiIndex.from_tuples(index)

In [186]:
index

MultiIndex([('student1', 'exam1'),
            ('student1', 'exam2'),
            ('student1', 'exam3'),
            ('student2', 'exam1'),
            ('student2', 'exam2'),
            ('student2', 'exam3'),
            ('student3', 'exam1'),
            ('student3', 'exam2'),
            ('student3', 'exam3')],
           )